# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [35]:
# Your code here
cur.execute("""
SELECT DISTINCT firstName,lastName,productname
FROM employees e
JOIN customers c
ON e.employeeNumber=c.salesRepEmployeeNumber
JOIN orders
USING (customerNumber)
JOIN orderdetails
USING (orderNumber)
JOIN products
USING (productCode)
""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

     firstName  lastName                                  productName
0       Leslie  Jennings                               1958 Setra Bus
1       Leslie  Jennings                       1940 Ford Pickup Truck
2       Leslie  Jennings                      1939 Cadillac Limousine
3       Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4       Leslie  Jennings                            1968 Ford Mustang
...        ...       ...                                          ...
1363    Martin    Gerard          1958 Chevy Corvette Limited Edition
1364    Martin    Gerard            1992 Porsche Cayenne Turbo Silver
1365    Martin    Gerard                  1954 Greyhound Scenicruiser
1366    Martin    Gerard       1950's Chicago Surface Lines Streetcar
1367    Martin    Gerard             Diamond T620 Semi-Skirted Tanker

[1368 rows x 3 columns]

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [24]:
# Your code here
cur.execute("""
SELECT o.officecode, o.city, COUNT(e.employeeNumber) as n_employees
FROM offices as o
LEFT JOIN employees as e
USING (officeCode)
GROUP BY officecode
HAVING n_employees = 0
""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [ ]:
# Your code here
SELECT e.employeeNumber, e.firstName, e.lastName,

## Level Up: Display the Number of Products each employee has sold

In [38]:
# Your code here
cur.execute("""
SELECT DISTINCT firstName,lastName,count(productname) AS num_products_sold
FROM employees e
JOIN customers c
ON e.employeeNumber=c.salesRepEmployeeNumber
JOIN orders
USING (customerNumber)
JOIN orderdetails
USING (orderNumber)
JOIN products
USING (productCode)
GROUP BY (employeeNumber)
ORDER BY firstName
""")
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

   firstName   lastName  num_products_sold
0       Andy     Fixter                185
1      Barry      Jones                220
2   Foon Yue      Tseng                142
3     George     Vanauf                211
4     Gerard  Hernandez                396
5      Julie   Firrelli                124
6      Larry       Bott                236
7     Leslie   Jennings                331
8     Leslie   Thompson                114
9       Loui     Bondur                177
10      Mami      Nishi                137
11    Martin     Gerard                114
12    Pamela   Castillo                272
13     Peter      Marsh                185
14     Steve  Patterson                152

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!